#include "DialogRenderWindow.h"

#include "LogUtil.h"
#include "MathUtil.h"
#include "MemoryUtil.h"
#include "WindowsUtil.h"

#include "NIAVObject.h"
#include "NIBound.h"
#include "NICamera.h"
#include "NICollisionSwitch.h"
#include "NIGeometry.h"
#include "NIMatrix33.h"
#include "NINode.h"
#include "NIPick.h"
#include "NILines.h"
#include "NITriShape.h"

#include "CSCell.h"
#include "CSDataHandler.h"
#include "CSDoor.h"
#include "CSGameFile.h"
#include "CSLandTexture.h"
#include "CSRecordHandler.h"
#include "CSReference.h"
#include "CSStatic.h"
#include "CSLand.h"

#include "RenderWindowSceneGraphController.h"
#include "RenderWindowSelectionData.h"
#include "RenderWindowWidgets.h"
#include "Settings.h"

#include "DialogLandscapeEditSettingsWindow.h"
#include "WindowMain.h"

#include "DialogProcContext.h"

namespace se::cs::dialog::render_window {
	__int16 lastCursorPosX = 0;
	__int16 lastCursorPosY = 0;

	std::default_random_engine generator;
	std::uniform_real_distribution<float> rotationDistribution(0.0, 360.0);
	std::uniform_real_distribution<float> scaleDistribution(0.5, 2.0);

	using gRenderWindowHandle = memory::ExternalGlobal<HWND, 0x6CE93C>;

	using gObjectMove = memory::ExternalGlobal<float, 0x6CE9B4>;
	using gObjectRotate = memory::ExternalGlobal<float, 0x6CE9B0>;

	using gCameraPan = memory::ExternalGlobal<float, 0x6CE9C0>;
	using gCameraRotate = memory::ExternalGlobal<float, 0x6CE9B8>;
	using gCameraZoom = memory::ExternalGlobal<float, 0x6CE9BC>;

	using gSnapGrid = memory::ExternalGlobal<int, 0x6CE9A8>;
	using gSnapAngleInDegrees = memory::ExternalGlobal<int, 0x6CE9AC>;
	using gCumulativeRotationValues = memory::ExternalGlobal<NI::Vector3, 0x6CF760>;
	using gPreviousCumulativeRotationValues = memory::ExternalGlobal<NI::Vector3, 0x6CF4A8>;

	using gRenderWindowPick = memory::ExternalGlobal<NI::Pick, 0x6CF528>;

	using gIsTranslating = memory::ExternalGlobal<bool, 0x6CF782>;
	using gIsRotating = memory::ExternalGlobal<bool, 0x6CF783>;
	using gIsHoldingV = memory::ExternalGlobal<bool, 0x6CF789>;
	using gIsHoldingX = memory::ExternalGlobal<bool, 0x6CF786>;
	using gIsHoldingY = memory::ExternalGlobal<bool, 0x6CF787>;
	using gIsHoldingZ = memory::ExternalGlobal<bool, 0x6CF788>;
	using gIsScaling = memory::ExternalGlobal<bool, 0x6CF785>;
	using gIsPanning = memory::ExternalGlobal<bool, 0x6CF78A>;

	void renderNextFrame() {
		using gRenderNextFrame = memory::ExternalGlobal<bool, 0x6CF78D>;
		gRenderNextFrame::set(true);
	}

	using gLandscapeEditDisc = memory::ExternalGlobal<NI::Lines*, 0x6CF4B4>;

	void updateLandscapeCircleWidget() {
		const auto widget = gLandscapeEditDisc::get();
		if (!widget) {
			return;
		}

		const auto vertexColorProp = widget->getVertexColorProperty();
		if (!vertexColorProp) {
			return;
		}

		NI::PackedColor color = settings.landscape_window.edit_circle_vertex;
		if (landscape_edit_settings_window::getFlattenLandscapeVertices()) {
			color = settings.landscape_window.edit_circle_flatten_vertex;
		}
		else if (landscape_edit_settings_window::getSoftenLandscapeVertices()) {
			color = settings.landscape_window.edit_circle_soften_vertex;
		}
		else if (landscape_edit_settings_window::getEditLandscapeColor()) {
			color = settings.landscape_window.edit_circle_color_vertex;
		}

		const auto modelData = widget->getModelData();
		for (auto i = 0u; i < modelData->getActiveVertexCount(); ++i) {
			modelData->color[i] = color;
		}

		renderNextFrame();
	}

	namespace RenderControlFlags {
		enum RenderControlFlags : DWORD {
			SnapToGrid = 0x1,
			SnapToAngle = 0x2,
			AllowRenderWindowCellLoads = 0x4,
			SkipInitialCellLoad = 0x10,
		};
	}
	using gRenderControlFlags = memory::ExternalGlobal<DWORD, 0x6CE9A4>;
	using gAutoSaveTime = memory::ExternalGlobal<int, 0x6CEA38>;

	const auto resetCumulativeRotationValues = reinterpret_cast<void(__stdcall*)()>(0x466470);

	// Convenience function to see if X, Y, or Z are held down.
	bool isHoldingAxisKey() {
		return gIsHoldingX::get() || gIsHoldingY::get() || gIsHoldingZ::get();
	}

	bool isGridSnapping() {
		return gRenderControlFlags::get() & RenderControlFlags::SnapToGrid;
	}

	bool isAngleSnapping() {
		return gRenderControlFlags::get() & RenderControlFlags::SnapToAngle;
	}

	bool isModifyingObject() {
		return gIsTranslating::get() || gIsRotating::get() || gIsScaling::get();
	}

	struct NetImmerseInstance {
		struct VirtualTable {
			void* dtor; // 0x0
			void* setRegistryKey; // 0x4
			void* setWindowWidth; // 0x8
			void* setWindowHeight; // 0xC
			void* setBitDepth; // 0x10
			void* setBackBuffers; // 0x14
			void* setMultisampleEnable; // 0x18
			void* setMultisamples; // 0x1C
			void* setFullScreen; // 0x20
			void(__thiscall* setPixelShaderEnabled)(NetImmerseInstance*, bool); // 0x24
			void* setStencil; // 0x28
			void* setMipmap; // 0x2C
			void* setMipmapSkipLevel; // 0x30
			void* setHardwareTL; // 0x34
			void* setMultipass; // 0x38
			void* setVertexProcessing; // 0x3C
			void* setSwapEffect; // 0x40
			void* setRefreshRate; // 0x44
			void* setPresentInterval; // 0x48
			void* setAdapterID; // 0x4C
			void(__thiscall* setGamma)(NetImmerseInstance*, float); // 0x50
			void* readSettings; // 0x54
			void* writeSettings; // 0x58
			void* createRenderer; // 0x5C
			void* createRendererFromSettings; // 0x60
		};
		VirtualTable* vTable; // 0x0
		const char* ownerString; // 0x4
		int windowWidth; // 0x8
		int windowHeight; // 0xC
		int screenDepth; // 0x10
		int backBuffers; // 0x14
		int multiSamples; // 0x18
		bool fullscreen; // 0x1C
		bool stencil; // 0x1D
		bool mipmap; // 0x1E
		bool hardware; // 0x1F
		bool pixelShader; // 0x20
		bool multiPass; // 0x21
		bool screenShotsEnabled; // 0x22
		int vertexProcessing; // 0x24
		int swapEffect; // 0x28
		int refreshRate; // 0x2C
		int adapter; // 0x30
		int mipmapSkipLevel; // 0x34
		int presentationInterval; // 0x38
		float gamma; // 0x3C
		NI::Vector3 unknown_0x40;
		NI::Pointer<NI::Node> node; // 0x4C
		NI::Renderer* renderer; // 0x50
		int unknown_0x54;
		HWND parentWindow; // 0x58
		int unknown_0x5C;
		int unknown_0x60;
	};
	static_assert(sizeof(NetImmerseInstance) == 0x64, "CS::NetImmerseInstance failed size validation");
	static_assert(sizeof(NetImmerseInstance::VirtualTable) == 0x64, "CS::NetImmerseInstance's virtual table failed size validation");


	//
	// Patch: Improve camera controls.
	//

	enum class CameraChangeType : unsigned int {
		PanX,
		PanY,
		PanZ,
		SetPositionX,
		SetPositionY,
		SetPositionZ,
		Unknown6,
		Unknown7,
		Unknown8,
		Unknown9,
		Unknown10,
		Unknown11,
	};

	float getHoveredSurfaceDistance() {
		auto camera = RenderController::get()->camera;

		NI::Vector3 origin;
		NI::Vector3 direction;
		if (!camera->windowPointToRay(lastCursorPosX, lastCursorPosY, origin, direction)) {
			return 0.0;
		}

		NI::Vector3 intersection;
		float zDistObject = 0.0f;
		float zDistLandscape = 0.0f;

		auto objectPick = SceneGraphController::get()->objectPick;
